using System.Collections.Generic;

namespace Models.Consts
{
    public static class ScientificDegrees
    {
        public static Dictionary<string, string> ScientificDegreeNames = new Dictionary<string, string>
        {
            { "Кандидат", "канд." },
            { "Доктор", "докт." }
        };

        public static Dictionary<string, string> ScientificDegreeSpecialties = new Dictionary<string, string>
        {
            { "архітектурних наук", "арх. наук" },
            { "біологічних наук", "біол. наук" },
            { "ветеринарних наук", "вет. наук" },
            { "військових наук", "військ. наук" },
            { "геолого-мінералогічних наук", "геол.-мін. наук" },
            { "історичних наук", "іст. наук" },
            { "культурології ", "культурології " },
            { "медичних наук", "мед. наук" },
            { "мистецтвознавства", "мистецтвознавства" },
            { "наук з державного управління", "держ. упр." },
            { "педагогічних наук", "пед. наук" },
            { "політичних наук", "пол. наук" },
            { "психологічних наук", "псих. наук" },
            { "сільськогосподарських наук", "с.-г. наук" },
            { "наук з соціальних комінукацій", "наук з соц. комун." },
            { "соціологічних наук", "соц. наук" },
            { "технічних наук", "тех. наук" },
            { "фармацевтичних наук", "фарм. наук" },
            { "фізико-математичних наук", "фіз.-мат. наук" },
            { "наук з фізичного виховання і спорту", "наук з фіз. вих. і спорту" },
            { "філологічних наук", "філ. наук" },
            { "філософських наук", "філос. наук" },
            { "хімічних наук", "хім. наук" },
            { "юридичних наук", "юр. наук" }
        };
    }
}
